dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/LFSS_1.0.xml
    <register id="LFSS_TIN3_0" width="32" offset="0x12A0" description="Tamper Input Register">
        <bitfield id="TIO0" description="This bit reads the data input value of tamper I/O 0." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO1" description="This bit reads the data input value of tamper I/O 1." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO2" description="This bit reads the data input value of tamper I/O 2." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO3" description="This bit reads the data input value of tamper I/O 3." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="LFSS_TIN7_4" width="32" offset="0x12A4" description="Tamper Input Register">
        <bitfield id="TIO4" description="This bit reads the data input value of tamper I/O 4." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO5" description="This bit reads the data input value of tamper I/O 5." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO6" description="This bit reads the data input value of tamper I/O 6." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO7" description="This bit reads the data input value of tamper I/O 7." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="LFSS_TIN11_8" width="32" offset="0x12A8" description="Tamper Input Register">
        <bitfield id="TIO8" description="This bit reads the data input value of tamper I/O 8." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO9" description="This bit reads the data input value of tamper I/O 9." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO10" description="This bit reads the data input value of tamper I/O 10." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO11" description="This bit reads the data input value of tamper I/O 11." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="LFSS_TIN15_12" width="32" offset="0x12AC" description="Tamper Input Register">
        <bitfield id="TIO12" description="This bit reads the data input value of tamper I/O 12." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO13" description="This bit reads the data input value of tamper I/O 13." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO14" description="This bit reads the data input value of tamper I/O 14." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="TIO15" description="This bit reads the data input value of tamper I/O 15." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="LFSS_HEARTBEAT" width="32" offset="0x12C0" description="Heartbeat Register">
        <bitfield id="HBINTERVAL" description="Heart beat interval" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="HBINT0P125" value="0x0" description="Heart beat interval 0.125 sec"/>
            <bitenum id="HBINT0P25" value="0x1" description="Heart beat interval 0.25 sec"/>
            <bitenum id="HBINT0P5" value="0x2" description="Heart beat interval 0.5 sec"/>
            <bitenum id="HBINT1" value="0x3" description="Heart beat interval 1 sec"/>
            <bitenum id="HBINT2" value="0x4" description="Heart beat interval 2 sec"/>
            <bitenum id="HBINT4" value="0x5" description="Heart beat interval 4 sec"/>
            <bitenum id="HBINT8" value="0x6" description="Heart beat interval 8 sec"/>
            <bitenum id="HBINT16" value="0x7" description="Heart beat interval 16 sec"/>
        </bitfield>
        <bitfield id="HBWIDTH" description="Heart beat interval width" begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="HBPWDTH1" value="0x0" description="Heart beat pulse width 1 msec"/>
            <bitenum id="HBPWDTH2" value="0x1" description="Heart beat pulse width 2 msec"/>
            <bitenum id="HBPWDTH4" value="0x2" description="Heart beat pulse width 4 msec"/>
            <bitenum id="HBPWDTH8" value="0x3" description="Heart beat pulse width 8 msec"/>
            <bitenum id="HBPWDTH16" value="0x4" description="Heart beat pulse width 16 msec"/>
            <bitenum id="HBPWDTH32" value="0x5" description="Heart beat pulse width 32 msec"/>
            <bitenum id="HBPWDTH64" value="0x6" description="Heart beat pulse width 64 msec"/>
            <bitenum id="HBPWDTH128" value="0x7" description="Heart beat pulse width 128 msec"/>
        </bitfield>
        <bitfield id="HBMODE" description="Heart beat mode" begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="HB_DIS" value="0x0" description="Heart beat disabled"/>
            <bitenum id="HB_ALLWAYS" value="0x1" description="Heart beat allways enabled"/>
            <bitenum id="HB_TS" value="0x2" description="Heart beat enabled when time stamp event detected"/>
            <bitenum id="HB_VDDFAIL" value="0x3" description="Heart beat when VDD has fail condition"/>
        </bitfield>
    </register>
