dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/LFSS_1.0.xml
    <register id="LFSS_SPMWPROT7" width="32" offset="0x151C" description="Scratch Pad Memory Write Protect Register 7">
        <bitfield id="WP_31_3" description="write protect SPMEM31 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_31_2" description="write protect SPMEM31 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_31_1" description="write protect SPMEM31 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_31_0" description="write protect SPMEM31 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_30_3" description="write protect SPMEM30 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_30_2" description="write protect SPMEM30- DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_30_1" description="write protect SPMEM30 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_30_0" description="write protect SPMEM30 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_29_3" description="write protect SPMEM29 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_29_2" description="write protect SPMEM29 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_29_1" description="write protect SPMEM29 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_29_0" description="write protect SPMEM29 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_28_3" description="write protect SPMEM28 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_28_2" description="write protect SPMEM28 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_28_1" description="write protect SPMEM28 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_28_0" description="write protect SPMEM28 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
    </register>
    <register id="LFSS_SPMTERASE0" width="32" offset="0x1540" description="Scratch Pad Memory Tamper Erase Register 0">
        <bitfield id="TE_3_3" description="tamper erase enable SPMEM3 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_3_2" description="tamper erase enable SPMEM3 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_3_1" description="tamper erase enable SPMEM3 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_3_0" description="tamper erase enable SPMEM3 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_2_3" description="tamper erase enable SPMEM2 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_2_2" description="tamper erase enable SPMEM2 - DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_2_1" description="tamper erase enable SPMEM2 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_2_0" description="tamper erase enable SPMEM2 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_1_3" description="tamper erase enable SPMEM1 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_1_2" description="tamper erase enable SPMEM1 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_1_1" description="tamper erase enable SPMEM1 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_1_0" description="tamper erase enable SPMEM1 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_0_3" description="tamper erase enable SPMEM0 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_0_2" description="tamper erase enable SPMEM0 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_0_1" description="tamper erase enable SPMEM0 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_0_0" description="tamper erase enable SPMEM0 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
    </register>
    <register id="LFSS_SPMTERASE1" width="32" offset="0x1544" description="Scratch Pad Memory Tamper Erase Register 1">
        <bitfield id="TE_7_3" description="tamper erase enable SPMEM7 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_7_2" description="tamper erase enable SPMEM7 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_7_1" description="tamper erase enable SPMEM7 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_7_0" description="tamper erase enable SPMEM7 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_6_3" description="tamper erase enable SPMEM6 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_6_2" description="tamper erase enable SPMEM6 - DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_6_1" description="tamper erase enable SPMEM6 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_6_0" description="tamper erase enable SPMEM6 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_5_3" description="tamper erase enable SPMEM5 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_5_2" description="tamper erase enable SPMEM5 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_5_1" description="tamper erase enable SPMEM5 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_5_0" description="tamper erase enable SPMEM5 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_4_3" description="tamper erase enable SPMEM4 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_4_2" description="tamper erase enable SPMEM4 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_4_1" description="tamper erase enable SPMEM4 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_4_0" description="tamper erase enable SPMEM4 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
    </register>
